public/man/man1/flatpak-remote-modify.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - flatpak-remote-modify.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - flatpak-remote-modify.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>flatpak-remote-modify - Modify a remote repository</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>flatpak remote-modify</strong> [OPTION…] NAME</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Modifies options for an existing remote repository in the flatpak
repository configuration. NAME is the name for the remote.</p>
<p>
Unless overridden with the <strong>–system</strong>, <strong>–user</strong>, or <strong>–installation</strong>
options, this command uses either the default system-wide installation
or the per-user one, depending on which has the specified REMOTE.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>The following options are understood:</p>
<p>
<strong>-h</strong>, <strong>–help</strong></p>
<blockquote>
<p>Show help options and exit.</p>
</blockquote>
<p>
<strong>-u</strong>, <strong>–user</strong></p>
<blockquote>
<p>Modify the per-user configuration.</p>
</blockquote>
<p>
<strong>–system</strong></p>
<blockquote>
<p>Modify the default system-wide configuration.</p>
</blockquote>
<p>
<strong>–installation=NAME</strong></p>
<blockquote>
<p>Modify a system-wide installation specified by NAME among those defined
in <em>etc/flatpak/installations.d</em>. Using <strong>–installation=default</strong> is
equivalent to using <strong>–system</strong>.</p>
</blockquote>
<p>
<strong>–no-gpg-verify</strong></p>
<blockquote>
<p>Disable GPG verification for the added remote.</p>
</blockquote>
<p>
<strong>–gpg-verify</strong></p>
<blockquote>
<p>Enable GPG verification for the added remote.</p>
</blockquote>
<p>
<strong>–prio=PRIO</strong></p>
<blockquote>
<p>Set the priority for the remote. Default is 1, higher is more
prioritized. This is mainly used for graphical installation tools.</p>
</blockquote>
<p>
<strong>–subset=SUBSET</strong></p>
<blockquote>
<p>Limit the refs available from the remote to those that are part of the
named subset.</p>
</blockquote>
<p>
<strong>–no-enumerate</strong></p>
<blockquote>
<p>Mark the remote as not enumerated. This means the remote will not be
used to list applications, for instance in graphical installation tools.
It will also not be used for runtime dependency resolution (as with
<strong>–no-use-for-deps</strong>).</p>
</blockquote>
<p>
<strong>–no-use-for-deps</strong></p>
<blockquote>
<p>Mark the remote as not to be used for automatic runtime dependency
resolution.</p>
</blockquote>
<p>
<strong>–disable</strong></p>
<blockquote>
<p>Disable the remote. Disabled remotes will not be automatically updated
from.</p>
</blockquote>
<p>
<strong>–enable</strong></p>
<blockquote>
<p>Enable the remote.</p>
</blockquote>
<p>
<strong>–enumerate</strong></p>
<blockquote>
<p>Mark the remote as enumerated. This means the remote will be used to
list applications, for instance in graphical installation tools.</p>
</blockquote>
<p>
<strong>–use-for-deps</strong></p>
<blockquote>
<p>Mark the remote as to be used for automatic runtime dependency
resolution.</p>
</blockquote>
<p>
<strong>–title=TITLE</strong></p>
<blockquote>
<p>A title for the remote, e.g. for display in a UI.</p>
</blockquote>
<p>
<strong>–comment=COMMENT</strong></p>
<blockquote>
<p>A single-line comment for the remote, e.g. for display in a UI.</p>
</blockquote>
<p>
<strong>–description=DESCRIPTION</strong></p>
<blockquote>
<p>A full-paragraph description for the remote, e.g. for display in a UI.</p>
</blockquote>
<p>
<strong>–homepage=URL</strong></p>
<blockquote>
<p>URL for a website for the remote, e.g. for display in a UI.</p>
</blockquote>
<p>
<strong>–icon=URL</strong></p>
<blockquote>
<p>URL for an icon for the remote, e.g. for display in a UI.</p>
</blockquote>
<p>
<strong>–default-branch=BRANCH</strong></p>
<blockquote>
<p>A default branch for the remote, mainly for use in a UI.</p>
</blockquote>
<p>
<strong>–collection-id=COLLECTION-ID</strong></p>
<blockquote>
<p>The globally unique identifier of the remote repository, to allow
mirrors to be grouped. This must only be set to the collection ID
provided by the remote, and must not be set if the remote does not
provide a collection ID.</p>
</blockquote>
<p>
<strong>–url=URL</strong></p>
<blockquote>
<p>Set a new URL.</p>
</blockquote>
<p>
<strong>–update-metadata</strong></p>
<blockquote>
<p>Update the remotes extra metadata from the OSTree repositorys summary
file. Only xa.title and xa.default-branch are supported at the moment.</p>
</blockquote>
<p>
<strong>–no-filter</strong>, <strong>–filter=FILE</strong></p>
<blockquote>
<p>Modify the path (or unset) for the local filter used for this remote.
See *flatpak-remote-add*(1) for details about the filter file format.</p>
</blockquote>
<p>
<strong>–gpg-import=FILE</strong></p>
<blockquote>
<p>Import gpg keys from the specified keyring file as trusted for the new
remote. If the file is - the keyring is read from standard input.</p>
</blockquote>
<p>
<strong>–authenticator-name=NAME</strong></p>
<blockquote>
<p>Specify the authenticator to use for the remote.</p>
</blockquote>
<p>
<strong>–authenticator-option=KEY=VALUE</strong></p>
<blockquote>
<p>Specify an authenticator option for the remote.</p>
</blockquote>
<p>
<strong>–authenticator-install</strong></p>
<blockquote>
<p>Enable auto-installation of authenticator.</p>
</blockquote>
<p>
<strong>–no-authenticator-install</strong></p>
<blockquote>
<p>Disable auto-installation of authenticator.</p>
</blockquote>
<p>
<strong>–follow-redirect</strong></p>
<blockquote>
<p>Follow xa.redirect-url defined in the summary file.</p>
</blockquote>
<p>
<strong>–no-follow-redirect</strong></p>
<blockquote>
<p>Do not follow xa.redirect-url defined in the summary file.</p>
</blockquote>
<p>
<strong>-v</strong>, <strong>–verbose</strong></p>
<blockquote>
<p>Print debug information during command processing.</p>
</blockquote>
<p>
<strong>–ostree-verbose</strong></p>
<blockquote>
<p>Print OSTree debug information during command processing.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
EXAMPLES
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p><strong>$ flatpak –user remote-modify –no-gpg-verify test-repo</strong></p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
SEE ALSO
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>*flatpak*(1), *flatpak-remote-add*(1), *flatpak-remote-delete*(1),
*flatpak-remotes*(1)</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
